app/controllers/chats_controller.rb

SELECT "chats".* FROM "chats"
---
  def index
    @chats = Chat.all

SELECT "chats".* FROM "chats" WHERE "chats"."id" = 3 LIMIT 1
---
  def show
    @chat = Chat.find(params[:id])

INSERT INTO "chats" ("name", "created_at", "updated_at") VALUES ('f', '2023-10-12 11:11:28.716635', '2023-10-12 11:11:28.716635') RETURNING "id"
---
  def create
    @chat = Chat.new(chat_params)

    if @chat.save