app/controllers/messages_controller.rb

  def create
    @chat = Chat.find(params[:chat_id])
---
SELECT "chats".* FROM "chats" WHERE "chats"."id" = 3 LIMIT 1